# Pandas

Let's practice with Pandas dataframes and series!

In [0]:
#Run these imports first
import numpy as np
import pandas as pd

### Series

Let's make a series, including one field with NaN (an empty value).

In [0]:
s = pd.Series([1,3,5,np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [0]:
# Accessing a member of the series:

s[4]

### Dataframes

Here we define dataframe.

In [0]:
df = pd.DataFrame({'date' : ['2016-01-01', '2016-01-02', '2016-01-03'],
                    'qty': [20, 30, 40]})
df

         date  qty
0  2016-01-01   20
1  2016-01-02   30
2  2016-01-03   40

Larger data should be loaded from a file.

In [0]:
rain = pd.read_csv('https://s3.amazonaws.com/elephantscale-public/data/rainfall/rainfall.csv')
rain

             City Month  Rainfall
0   San Francisco   Jan      10.0
1         Seattle   Jan      30.0
2     Los Angeles   Jan       2.0
3         Seattle   Feb      20.0
4   San Francisco   Feb       4.0
5     Los Angeles   Feb       0.0
6         Seattle   Mar      22.0
7   San Francisco   Mar       4.0
8     Los Angeles   Mar       NaN
9         Seattle   Apr       NaN
10  San Francisco   Apr       5.0
11    Los Angeles   Apr       4.0

In [0]:
# Let's load a column

0     San Francisco
1           Seattle
2       Los Angeles
3           Seattle
4     San Francisco
5       Los Angeles
6           Seattle
7     San Francisco
8       Los Angeles
9           Seattle
10    San Francisco
11      Los Angeles
Name: City, dtype: object

We can also get a column by index number.(starting from zero)

In [0]:
rain.iloc[:,0]

0     San Francisco
1           Seattle
2       Los Angeles
3           Seattle
4     San Francisco
5       Los Angeles
6           Seattle
7     San Francisco
8       Los Angeles
9           Seattle
10    San Francisco
11      Los Angeles
Name: City, dtype: object

We can also get a row by index number

In [0]:
# Let's load a row
rain.iloc[[1]]

      City Month  Rainfall
1  Seattle   Jan      30.0

Or a group of rows by index number

In [0]:
rain.iloc[:, 0]

0     San Francisco
1           Seattle
2       Los Angeles
3           Seattle
4     San Francisco
5       Los Angeles
6           Seattle
7     San Francisco
8       Los Angeles
9           Seattle
10    San Francisco
11      Los Angeles
Name: City, dtype: object

In [0]:
We can even get a sub-dataframe using iloc

```python rain.iloc [0, 1]```

SyntaxError: ignored

In [0]:
# TODO: How would you get row # 1 through 3, with the first 2 columns?

# Filtering

We can filter rows like this:

In [0]:
#find all rainfall less than 10

             City Month  Rainfall
2     Los Angeles   Jan       2.0
4   San Francisco   Feb       4.0
5     Los Angeles   Feb       0.0
7   San Francisco   Mar       4.0
10  San Francisco   Apr       5.0
11    Los Angeles   Apr       4.0

# Filter Exercises

Complete the following:

In [0]:
# How would we find all reading for Aprils (in all cities)?

SyntaxError: ignored

In [0]:
# How would we find all readings for Los Angeles?
rain.iloc[[5]]

          City Month  Rainfall
5  Los Angeles   Feb       0.0

# Naming Rows

We can give rows names instead of numbers.

In [0]:
rain.set_index(rain['City']  + rain['Month'])

                           City Month  Rainfall
San FranciscoJan  San Francisco   Jan      10.0
SeattleJan              Seattle   Jan      30.0
Los AngelesJan      Los Angeles   Jan       2.0
SeattleFeb              Seattle   Feb      20.0
San FranciscoFeb  San Francisco   Feb       4.0
Los AngelesFeb      Los Angeles   Feb       0.0
SeattleMar              Seattle   Mar      22.0
San FranciscoMar  San Francisco   Mar       4.0
Los AngelesMar      Los Angeles   Mar       NaN
SeattleApr              Seattle   Apr       NaN
San FranciscoApr  San Francisco   Apr       5.0
Los AngelesApr      Los Angeles   Apr       4.0

### Setting the index.

In Pandas we have something called the index.  Here's how we use the index to get rows:

```python
rain.loc[0]  #will get row at index '0' as a series
rain.loc[[0]] #will get row at index '0' as a one-row dataframe
```

Just like columns can be accessed by both number and name, rows also can be accessed by either number or name.  

By default, the index is simply the row number starting from zero, but this can be changed or overridden.

``` rain.set_index("colname")
```

In [0]:
rain.set_index(rain['City']  + rain['Month'])

                           City Month  Rainfall
San FranciscoJan  San Francisco   Jan      10.0
SeattleJan              Seattle   Jan      30.0
Los AngelesJan      Los Angeles   Jan       2.0
SeattleFeb              Seattle   Feb      20.0
San FranciscoFeb  San Francisco   Feb       4.0
Los AngelesFeb      Los Angeles   Feb       0.0
SeattleMar              Seattle   Mar      22.0
San FranciscoMar  San Francisco   Mar       4.0
Los AngelesMar      Los Angeles   Mar       NaN
SeattleApr              Seattle   Apr       NaN
San FranciscoApr  San Francisco   Apr       5.0
Los AngelesApr      Los Angeles   Apr       4.0

### Pandas and changes in-place

**Most** (but not all) changes to the dataframe do not happen in-place.  This means that they return a mutated copy of the data, but don't touch the original data.

Let's try referencing the rainfall after setting the dataframe index as above.

In [0]:
# Let us try referencing this -- Note: it won't work.
rain.loc['San FranciscoJan']  # ERROR!

set_index, and many other functions returns a mutated dataframe and does NOT change it in-place. If we want to apply the change we can write on top of the old dataframe.

In [0]:
rain = rain.set_index(rain['City']  + rain['Month'])
                    
rain

                           City Month  Rainfall
San FranciscoJan  San Francisco   Jan      10.0
SeattleJan              Seattle   Jan      30.0
Los AngelesJan      Los Angeles   Jan       2.0
SeattleFeb              Seattle   Feb      20.0
San FranciscoFeb  San Francisco   Feb       4.0
Los AngelesFeb      Los Angeles   Feb       0.0
SeattleMar              Seattle   Mar      22.0
San FranciscoMar  San Francisco   Mar       4.0
Los AngelesMar      Los Angeles   Mar       NaN
SeattleApr              Seattle   Apr       NaN
San FranciscoApr  San Francisco   Apr       5.0
Los AngelesApr      Los Angeles   Apr       4.0

In [0]:
rain.loc['San FranciscoJan']  #Should Work Now

City        San Francisco
Month                 Jan
Rainfall               10
Name: San FranciscoJan, dtype: object

Most functions can in fact change data in place with the optional inPlace parameter.

```python
 rain.set_index(rain['City']  + rain['Month'], inplace=True)
```